// wordList.js
// 주제별 단어 리스트. 얼마든지 추가 가능합니다.
module.exports = {
    "과일": ["수박", "사과", "두리안", "망고스틴", "바나나", "딸기", "포도", "키위", "복숭아", "망고", "파인애플", "오렌지", "참외", "자두"],
    "동물": ["강아지", "고양이", "사자", "호랑이", "코끼리", "기린", "원숭이", "토끼", "판다", "펭귄", "돌고래", "독수리"],
    "가전제품": ["냉장고", "세탁기", "에어컨", "TV", "전자레인지", "청소기", "컴퓨터", "드라이기", "선풍기", "다리미"],
    "직업": ["의사", "백수", "선생님", "경찰관", "소방관", "요리사", "가수", "배우", "운동선수", "프로그래머", "변호사"],
    "영화/애니메이션": ["귀멸의 칼날", "아이언맨", "스파이더맨", "배트맨", "해리포터", "반지의 제왕", "겨울왕국", "토이스토리", "원피스", "나루토", "포켓몬스터"],
    "장소": ["학교", "병원", "경찰서", "소방서", "공원", "도서관", "영화관", "백화점", "놀이공원", "동물원", "수영장", "식당"],
    "음식": ["김치찌개", "된장찌개", "비빔밥", "불고기", "떡볶이", "라면", "짜장면", "짬뽕", "탕수육", "치킨", "피자", "햄버거"],
    "스포츠": ["축구", "야구", "농구", "배구", "테니스", "골프", "수영", "달리기", "스키", "스케이트"],
    "국가": ["대한민국", "미국", "중국", "일본", "영국", "프랑스", "독일", "이탈리아", "캐나다", "호주"],
    "교통수단": ["전동킥보드", "버스", "지하철", "기차", "비행기", "배", "자전거", "오토바이", "택시"],
    "우리방 사람": ["네오", "부타", "슈", "심심이", "아무", "뚜", "미미", "고래", "월기", "월도"]
};